{
  "id": "flumph",
  "name": "Flumph",
  "baseStats": {
    "abilities": {
      "str": 6,
      "dex": 15,
      "con": 10,
      "int": 14,
      "wis": 14,
      "cha": 11
    },
    "armorClass": {
      "value": 12
    },
    "hitPoints": {
      "max": 7,
      "formula": "2d6"
    },
    "speed": 5,
    "saves": [],
    "skills": {
      "arcana": "proficient",
      "history": "proficient",
      "religion": "proficient"
    }
  },
  "traits": [
    {
      "name": "Advanced Telepathy",
      "description": [
        "The flumph perceives the content of any telepathic communication within 60 feet of it."
      ]
    },
    {
      "name": "Prone Deficiency",
      "description": [
        "If the flumph receives the Prone condition, roll a die. On an odd number, it has the Incapacitated condition.",
        "At the end of each of its turns, the flumph makes a DC 10 Dexterity saving throw, ending the Incapacitated condition on a success."
      ]
    },
    {
      "name": "Telepathic Shroud",
      "description": [
        "The flumph's thoughts can't be read by any means, and magic can't detect its location or observe it remotely."
      ]
    }
  ],
  "advancement": {
    "abilityScoreIncreases": {
      "levels": [
        5,
        9,
        13,
        17,
        20
      ],
      "maxScore": 20
    },
    "skills": {
      "levels": [
        4,
        8,
        12,
        16,
        19
      ],
      "choices": [
        "feats",
        "attacks",
        "specialSkills"
      ]
    },
    "featsOrAttacks": {
      "levels": [],
      "choices": []
    }
  },
  "baseAttacks": [
    {
      "name": "Tentacle",
      "description": [
        "Melee Attack Roll: +4, reach 5 feet.",
        "Hit: 4 (1d4 + 2) Acid damage."
      ]
    },
    {
      "name": "Stench Spray",
      "description": [
        "Stench Spray (1/Proficiency Level).",
        "Dexterity Saving Throw: one creature the flumph can see within 15 feet.",
        "Failure: The target is coated in a foul-smelling liquid, exudes a stench for 1d4 hours, and has the Poisoned condition while the stench lasts.",
        "Other creatures have the Poisoned condition while in a 5-foot emanation originating from the coated target.",
        "The target can remove the stench on itself if it bathes during a Short or Long Rest."
      ]
    }
  ],
  "lists": {
    "feats": [
      {
        "name": "Empathic Shield",
        "description": [
          "When an ally within 30 feet takes damage, the flumph can use its reaction to reduce the damage by 1d8 + the flumph's proficiency bonus.",
          "Uses equal to the flumph's proficiency bonus per long rest."
        ]
      },
      {
        "name": "Thought Static",
        "description": [
          "Creatures poisoned by the flumph's Stench Spray have disadvantage on Wisdom saving throws until the end of their next turn."
        ]
      },
      {
        "name": "Psychic Veil",
        "description": [
          "Once per long rest, the flumph and its master become invisible to creatures relying on telepathy, empathy, or psychic senses for 1 minute."
        ]
      },
      {
        "name": "Hover Guard",
        "description": [
          "While the flumph is adjacent to its master, the master has advantage on saving throws against charm and fear effects."
        ]
      },
      {
        "name": "Psionic Recoil",
        "description": [
          "When the flumph succeeds on a saving throw against a spell or magical effect, the creature that forced the saving throw takes psychic damage equal to the flumph's proficiency bonus."
        ]
      },
      {
        "name": "Resonant Backlash",
        "description": [
          "Prerequisite: Psychic Rebound reaction.",
          "When the flumph uses Psychic Rebound, it can choose to amplify the effect.",
          "The psychic damage dealt by Psychic Rebound increases by an amount equal to the flumph's Wisdom modifier.",
          "Until the start of the flumph's next turn, the attacker has disadvantage on saving throws against effects created by the flumph or its master.",
          "Once the flumph uses Resonant Backlash, it cannot do so again until it finishes a long rest."
        ]
      }
    ],
    "attacks": [
      {
        "name": "Psychic Pulse",
        "description": [
          "Ranged Psionic Attack: +4 to hit, range 30 ft., one target.",
          "Hit: 1d8 psychic damage.",
          "The target has disadvantage on its next attack roll before the end of its next turn."
        ]
      },
      {
        "name": "Disorienting Tentacle",
        "description": [
          "Melee Weapon Attack: +4 to hit, reach 5 ft., one target.",
          "Hit: 1d6 + 2 bludgeoning damage.",
          "The target's speed is reduced to 0 until the start of its next turn."
        ]
      },
      {
        "name": "Mind Ripple",
        "description": [
          "Psionic Burst: Each creature of the flumph's choice within 10 feet must succeed on a Wisdom saving throw or take 1d6 psychic damage and have disadvantage on its next saving throw before the end of its next turn."
        ]
      },
      {
        "name": "Psychic Rebound",
        "description": [
          "Reaction.",
          "When a creature within 15 feet hits the flumph or its master with an attack, the attacker takes psychic damage equal to twice the flumph's proficiency bonus and the next attack rolls against it have advantage."
        ]
      }
    ],
    "specialSkills": [
      {
        "name": "Companion Bond",
        "description": [
          "The flumph instinctively protects its master.",
          "If the master is incapacitated, the flumph prioritizes warning allies, interposing itself, and disrupting hostile creatures."
        ]
      },
      {
        "name": "Aberrant Insight",
        "description": [
          "The flumph gains expertise in Insight.",
          "It has advantage on Insight checks made to detect hostile intent, emotional manipulation, or deceit."
        ]
      },
      {
        "name": "Mind Anchor",
        "description": [
          "While the flumph is within 10 feet of its master, neither the flumph nor its master can be charmed or frightened."
        ]
      },
      {
        "name": "Psychic Dampener",
        "description": [
          "Creatures of the flumph's choice within 10 feet have disadvantage on the first attack roll they make each turn."
        ]
      },
      {
        "name": "Ninefold Calm",
        "description": [
          "When the flumph is reduced to 0 hit points but not killed outright, it instead drops to 1 hit point and becomes invisible until the end of its next turn.",
          "Once this trait is used, it cannot be used again until the flumph finishes a long rest."
        ]
      }
    ]
  }
}
